<script setup>
  import LibText from '../../entities/LibText/LibText.vue';
  import LibBook from '../../entities/LibBook/LibBook.vue';
  import DownBar from '../../entities/DownBar/DownBar.vue';
  import { ref, watch } from 'vue';
  import ActionBtn from '../../entities/ActionBtn/ActionBtn.vue';

  import { book, changeBookTitle } from '../../shared/store/book.js';
  
  const books = ref([
    {
      _id: 1,
      title: 'First',
      content: 'Есть много вариантов Lorem Ipsum, но большинство из них имеет не всегда приемлемые модификации, например, юмористические вставки или слова, которые даже отдалённо не напоминают латынь. Если вам нужен Lorem Ipsum для серьёзного проекта, вы наверняка не хотите какой-нибудь шутки, скрытой в середине абзаца. Также все другие известные генераторы Lorem Ipsum используют один и тот же текст, который они просто повторяют, пока не достигнут нужный объём. Это делает предлагаемый здесь генератор единственным настоящим Lorem Ipsum генератором. Он использует словарь из более чем 200 латинских слов, а также набор моделей предложений. В результате сгенерированный Lorem Ipsum выглядит правдоподобно, не имеет повторяющихся абзацей или "невозможных" слов.'
    },
    {
      _id: 2,
      title: 'Second',
      content: 'lorem ipsum'
    },
    {
      _id: 3,
      title: '',
      content: 'Есть много вариантов Lorem Ipsum, но большинство из них имеет не всегда приемлемые модификации, например, юмористические вставки или слова, которые даже отдалённо не напоминают латынь. Если вам нужен Lorem Ipsum для серьёзного проекта, вы наверняка не хотите какой-нибудь шутки, скрытой в середине абзаца. Также все другие известные генераторы Lorem Ipsum используют один и тот же текст, который они просто повторяют, пока не достигнут нужный объём. Это делает предлагаемый здесь генератор единственным настоящим Lorem Ipsum генератором. Он использует словарь из более чем 200 латинских слов, а также набор моделей предложений. В результате сгенерированный Lorem Ipsum выглядит правдоподобно, не имеет повторяющихся абзацей или "невозможных" слов.'
    },
    {
      _id: 4,
      title: '',
      content: 'Есть много вариантов Lorem Ipsum, но большинство из них имеет не всегда приемлемые модификации, например, юмористические вставки или слова, которые даже отдалённо не напоминают латынь. Если вам нужен Lorem Ipsum для серьёзного проекта, вы наверняка не хотите какой-нибудь шутки, скрытой в середине абзаца. Также все другие известные генераторы Lorem Ipsum используют один и тот же текст, который они просто повторяют, пока не достигнут нужный объём. Это делает предлагаемый здесь генератор единственным настоящим Lorem Ipsum генератором. Он использует словарь из более чем 200 латинских слов, а также набор моделей предложений. В результате сгенерированный Lorem Ipsum выглядит правдоподобно, не имеет повторяющихся абзацей или "невозможных" слов.'
    },
    {
      _id: 5,
      title: '',
      content: 'Есть много вариантов Lorem Ipsum, но большинство из них имеет не всегда приемлемые модификации, например, юмористические вставки или слова, которые даже отдалённо не напоминают латынь. Если вам нужен Lorem Ipsum для серьёзного проекта, вы наверняка не хотите какой-нибудь шутки, скрытой в середине абзаца. Также все другие известные генераторы Lorem Ipsum используют один и тот же текст, который они просто повторяют, пока не достигнут нужный объём. Это делает предлагаемый здесь генератор единственным настоящим Lorem Ipsum генератором. Он использует словарь из более чем 200 латинских слов, а также набор моделей предложений. В результате сгенерированный Lorem Ipsum выглядит правдоподобно, не имеет повторяющихся абзацей или "невозможных" слов.'
    },
    {
      _id: 6,
      title: '',
      content: 'Есть много вариантов Lorem Ipsum, но большинство из них имеет не всегда приемлемые модификации, например, юмористические вставки или слова, которые даже отдалённо не напоминают латынь. Если вам нужен Lorem Ipsum для серьёзного проекта, вы наверняка не хотите какой-нибудь шутки, скрытой в середине абзаца. Также все другие известные генераторы Lorem Ipsum используют один и тот же текст, который они просто повторяют, пока не достигнут нужный объём. Это делает предлагаемый здесь генератор единственным настоящим Lorem Ipsum генератором. Он использует словарь из более чем 200 латинских слов, а также набор моделей предложений. В результате сгенерированный Lorem Ipsum выглядит правдоподобно, не имеет повторяющихся абзацей или "невозможных" слов.'
    },
    {
      _id: 7,
      title: '',
      content: 'Есть много вариантов Lorem Ipsum, но большинство из них имеет не всегда приемлемые модификации, например, юмористические вставки или слова, которые даже отдалённо не напоминают латынь. Если вам нужен Lorem Ipsum для серьёзного проекта, вы наверняка не хотите какой-нибудь шутки, скрытой в середине абзаца. Также все другие известные генераторы Lorem Ipsum используют один и тот же текст, который они просто повторяют, пока не достигнут нужный объём. Это делает предлагаемый здесь генератор единственным настоящим Lorem Ipsum генератором. Он использует словарь из более чем 200 латинских слов, а также набор моделей предложений. В результате сгенерированный Lorem Ipsum выглядит правдоподобно, не имеет повторяющихся абзацей или "невозможных" слов.'
    },
    {
      _id: 8,
      title: '',
      content: 'Есть много вариантов Lorem Ipsum, но большинство из них имеет не всегда приемлемые модификации, например, юмористические вставки или слова, которые даже отдалённо не напоминают латынь. Если вам нужен Lorem Ipsum для серьёзного проекта, вы наверняка не хотите какой-нибудь шутки, скрытой в середине абзаца. Также все другие известные генераторы Lorem Ipsum используют один и тот же текст, который они просто повторяют, пока не достигнут нужный объём. Это делает предлагаемый здесь генератор единственным настоящим Lorem Ipsum генератором. Он использует словарь из более чем 200 латинских слов, а также набор моделей предложений. В результате сгенерированный Lorem Ipsum выглядит правдоподобно, не имеет повторяющихся абзацей или "невозможных" слов.'
    },
    {
      _id: 9,
      title: '',
      content: 'Есть много вариантов Lorem Ipsum, но большинство из них имеет не всегда приемлемые модификации, например, юмористические вставки или слова, которые даже отдалённо не напоминают латынь. Если вам нужен Lorem Ipsum для серьёзного проекта, вы наверняка не хотите какой-нибудь шутки, скрытой в середине абзаца. Также все другие известные генераторы Lorem Ipsum используют один и тот же текст, который они просто повторяют, пока не достигнут нужный объём. Это делает предлагаемый здесь генератор единственным настоящим Lorem Ipsum генератором. Он использует словарь из более чем 200 латинских слов, а также набор моделей предложений. В результате сгенерированный Lorem Ipsum выглядит правдоподобно, не имеет повторяющихся абзацей или "невозможных" слов.'
    },
  ])


  const saving_title = ref("");
  const save_btn_is_active = ref(false);

  watch(book, () => {
    saving_title.value = book.title;
    save_btn_is_active.value = false;
    console.log('watch happened')
  })

  const theTitleChanging = (e) => {
    save_btn_is_active.value = true;
    saving_title.value = e.target.value;
  }
  const theTitleChanged = () => {
    changeBookTitle(saving_title.value);

    saving_title.value = "";
    save_btn_is_active.value = false;

    books.value.map(tbook => {
      if (tbook._id === book._id) {
        tbook.title = book.title;
        return tbook;
      }
    })
  }
  
  

</script>
 
<template>
  <div class="lib-form">
    <div class="sidebar">
      <div class="list">
        <LibBook v-for="book in books" :key="book._id" :book_itself="book" />
      </div>
    </div>
    <div class="main">
      <input class="title-input" type="text" placeholder="Write title" @input="theTitleChanging" :value="saving_title" />
      <LibText :content="book.content" />
      <div class="down-group">
        <ActionBtn v-if="save_btn_is_active" @click="theTitleChanged()" class="actionBtn">Save</ActionBtn>
        <DownBar />
      </div>
    </div>
  </div>
</template>
 
<style lang="scss" scoped>
  @import '../../shared/styles/colors.scss';
  @import '../../shared/styles/form.scss';
  @import '../../shared/styles/typo.scss';
  .lib-form {
    background-color: $background;
    display: flex;
    @extend %form;
  }
  .sidebar {
    flex: 220px 0 0;
    height: 100%;
    border-right: 1px solid $rest;
  }
  .list {
    height: 100%;
    flex-direction: column;
    overflow-y: scroll;
    &::-webkit-scrollbar {
      width: 5px;               /* ширина всей полосы прокрутки */
    }

    &::-webkit-scrollbar-track {
      background: $scroll-bcg;        /* цвет зоны отслеживания */
    }

    &::-webkit-scrollbar-thumb {
      background-color: $main;    /* цвет бегунка */
      border-radius: 20px;       /* округлось бегунка */
      border: none;  /* отступ вокруг бегунка */
    }
    

  }
  .title-input {
      margin-bottom: 20px;
      color: $text;
      @extend %large-text;
      &::placeholder {
        color: $placeholder;
      }
  }
  .main {
    width: 100%;
    height: 100%;
    padding: 19px 33px 0 13px;
    display: flex;
    flex-direction: column;
  }
  .down-group {
    display: flex;
    align-items: center;
  }
</style>